
{
    "1": [
          "<strong>✨ Monthly Vibe:</strong> Leadership, confidence, and new beginnings are your focus this month. Trust your instincts and take charge. <strong>💼 Career & Money:</strong> Take bold steps in your career, start new projects, and plan financial moves wisely. <strong>💖 Relationships:</strong> Show initiative in love; your confidence will attract positive attention. <strong>🧘 Health Tip:</strong> Stay active and avoid overexertion—balance work and rest. <strong>🎯 Lucky Days & Numbers:</strong> Days: 1, 10, 19, 28 | Numbers: 1, 4, 7. <strong>🌟 Quick Tip:</strong> \"Lead with courage—your energy sets the tone for success.\""
    ],
    "2": [
        "🌟 Love Life: This month calls for emotional intimacy. A kind word can heal deep wounds.\n",
        "💰 Financial Outlook: Collaborations or shared ventures show promise.\n",
        "🧠 Emotional Wellbeing: Meditation and quiet time will help restore your peace.\n",
        "🚀 Growth: Develop your empathetic side—it’s your hidden strength.\n",
        "🎯 Focus: Inner balance and relationships.",

        "🌟 Love Life: Harmony can be restored by listening more and speaking less.\n",
        "💰 Financial Outlook: Not a month for major risks—let money matters unfold slowly.\n",
        "🧠 Emotional Wellbeing: You're more sensitive now. Be around those who value your feelings.\n",
        "🚀 Growth: Let your nurturing side take the lead.\n",
        "🎯 Focus: Soft power and connection.",

        "🌟 Love Life: Romantic vulnerability may feel scary, but it's your bridge to connection.\n",
        "💰 Financial Outlook: Think long-term, especially in shared financial planning.\n",
        "🧠 Emotional Wellbeing: Release emotional baggage gently.\n",
        "🚀 Growth: Move forward through emotional wisdom.\n",
        "🎯 Focus: Compassion and emotional growth."
    ],
    "3": [
        "🌟 Love Life: Laughter and joy enhance romance. Let your charm lead the way.\n",
        "💰 Financial Outlook: Creative ideas could generate income—take notes and take action.\n",
        "🧠 Emotional Wellbeing: Uplifting music or writing will boost your mood.\n",
        "🚀 Growth: Speak your truth with flair.\n",
        "🎯 Focus: Expressive energy and joy.",

        "🌟 Love Life: Your light-hearted nature is magnetic—be your full self.\n",
        "💰 Financial Outlook: Unexpected cash flow possible through presentations or sales.\n",
        "🧠 Emotional Wellbeing: Avoid overcommitting. Keep space for fun.\n",
        "🚀 Growth: Shine unapologetically.\n",
        "🎯 Focus: Creative communication.",

        "🌟 Love Life: You’ll attract admirers when you express your heart without fear.\n",
        "💰 Financial Outlook: Invest in something that excites you—within reason.\n",
        "🧠 Emotional Wellbeing: Let your emotions flow into art or journaling.\n",
        "🚀 Growth: Your voice is your power.\n",
        "🎯 Focus: Artistic release and clarity."
    ],
    "4": [
        "🌟 Love Life: Your loyalty strengthens bonds this month. Don’t be afraid to show love through actions.\n",
        "💰 Financial Outlook: Financial progress comes through consistency.\n",
        "🧠 Emotional Wellbeing: Clean spaces = calm mind. Declutter.\n",
        "🚀 Growth: Commit to long-term health or learning.\n",
        "🎯 Focus: Structure and dedication.",

        "🌟 Love Life: Predictability can be romantic—rituals and reliability feel safe.\n",
        "💰 Financial Outlook: Organize bills and revisit saving plans.\n",
        "🧠 Emotional Wellbeing: Sleep patterns matter. Protect your rest.\n",
        "🚀 Growth: Build what you want to last.\n",
        "🎯 Focus: Systems and order.",

        "🌟 Love Life: If single, focus on self-worth. If partnered, take responsibility lovingly.\n",
        "💰 Financial Outlook: A long-awaited breakthrough may arrive mid-month.\n",
        "🧠 Emotional Wellbeing: Watch for rigid thinking—be flexible.\n",
        "🚀 Growth: Stability is your gift.\n",
        "🎯 Focus: Routine with purpose."
    ],
    "5": [
      "<strong>✨ Monthly Vibe:</strong> Change, adventure, and freedom define this month. Expect surprises and embrace opportunities that push you out of your comfort zone. <strong>💼 Career & Money:</strong> Be open to exploring new ideas and projects. Financially, avoid impulsive decisions—think long-term. <strong>💖 Relationships:</strong> Spontaneity will help strengthen your bonds. If single, social gatherings and travel could lead to exciting connections. <strong>🧘 Health Tip:</strong> Stay active—movement, travel, or outdoor activities will recharge your energy. <strong>🎯 Lucky Days & Numbers:</strong> Days: 5, 14, 23 | Numbers: 5, 3, 6. <strong>🌟 Quick Tip:</strong> \"Say yes to new experiences—adventure will lead to growth.\""
    ],
    "6": [
        "🌟 Love Life: Deep emotional connection is possible now. Cook together, plan home updates.\n",
        "💰 Financial Outlook: Watch out for guilt-driven spending on family.\n",
        "🧠 Emotional Wellbeing: Offer support without overextending.\n",
        "🚀 Growth: Give your love space to grow.\n",
        "🎯 Focus: Emotional balance and care.",

        "🌟 Love Life: Healing conversations improve romantic energy.\n",
        "💰 Financial Outlook: Manage home finances together for harmony.\n",
        "🧠 Emotional Wellbeing: Boundaries = peace.\n",
        "🚀 Growth: Prioritize connection.\n",
        "🎯 Focus: Family and harmony.",

        "🌟 Love Life: Rekindling love is favored. Invest in emotional security.\n",
        "💰 Financial Outlook: Moderate income, high emotional return.\n",
        "🧠 Emotional Wellbeing: Say no without guilt.\n",
        "🚀 Growth: Caring builds character.\n",
        "🎯 Focus: Responsibility and love."
    ],
    "7": [
        "🌟 Love Life: You may seek silence over romance—be honest about your needs.\n",
        "💰 Financial Outlook: Research is more useful than action now.\n",
        "🧠 Emotional Wellbeing: Journal your inner truths.\n",
        "🚀 Growth: Clarity through solitude.\n",
        "🎯 Focus: Spiritual inquiry.",

        "🌟 Love Life: You connect more on a soul level—shallow talk won’t do.\n",
        "💰 Financial Outlook: Plan your next big financial step—but don't execute yet.\n",
        "🧠 Emotional Wellbeing: Meditation opens insight.\n",
        "🚀 Growth: Dive deep within.\n",
        "🎯 Focus: Intuition and wisdom.",

        "🌟 Love Life: Let mystery be your language. Romantic interest may arise through shared spiritual interests.\n",
        "💰 Financial Outlook: Income may be limited, but insight grows.\n",
        "🧠 Emotional Wellbeing: Retreat, don't escape.\n",
        "🚀 Growth: Inner mastery.\n",
        "🎯 Focus: Deep listening."
    ],
    "8": [
        "🌟 Love Life: Relationships grow when power is shared, not asserted.\n",
        "💰 Financial Outlook: Major leap possible—especially in career.\n",
        "🧠 Emotional Wellbeing: Success feels better when shared.\n",
        "🚀 Growth: Step into leadership.\n",
        "🎯 Focus: Vision and execution.",

        "🌟 Love Life: Show up strong, but emotionally available too.\n",
        "💰 Financial Outlook: High earning potential. Investments may mature.\n",
        "🧠 Emotional Wellbeing: Release control to find peace.\n",
        "🚀 Growth: Build your empire.\n",
        "🎯 Focus: Legacy-building.",

        "🌟 Love Life: Be present, not just productive. Love doesn’t need fixing.\n",
        "💰 Financial Outlook: Think long-term strategy. Avoid greed traps.\n",
        "🧠 Emotional Wellbeing: Let go of status anxiety.\n",
        "🚀 Growth: Lead from the heart.\n",
        "🎯 Focus: Power with purpose."
    ],
    "9": [
        "🌟 Love Life: Let go of attachments. The right people stay.\n",
        "💰 Financial Outlook: Review old expenses or close financial loops.\n",
        "🧠 Emotional Wellbeing: Grieve gently and grow.\n",
        "🚀 Growth: Embrace endings.\n",
        "🎯 Focus: Forgiveness and flow.",

        "🌟 Love Life: Your empathy deepens. Healing a past connection may free you.\n",
        "💰 Financial Outlook: Give without overgiving.\n",
        "🧠 Emotional Wellbeing: Let yourself feel deeply.\n",
        "🚀 Growth: Closure brings clarity.\n",
        "🎯 Focus: Service and self-worth.",

        "🌟 Love Life: Expect a spiritual shift in how you love. Less need, more grace.\n",
        "💰 Financial Outlook: Don’t start new investments—finish old ones.\n",
        "🧠 Emotional Wellbeing: Release control, feel freedom.\n",
        "🚀 Growth: Your peace heals others.\n",
        "🎯 Focus: Completion and wisdom."
    ]
}

