{
    "1": [
        "<strong>✨ Yearly Vibe:</strong> This year is all about new beginnings, leadership, and stepping confidently into your power. It’s time to take charge of your destiny and break free from past limitations. <strong>💼 Career & Money:</strong> Start new ventures, aim for leadership roles, and plan financial goals strategically. The second half of the year is rewarding for investments and growth. <strong>💖 Relationships:</strong> Your confidence will attract love and admiration. If single, you may meet someone through work or social circles. <strong>🧘 Health Tip:</strong> Balance ambition with rest to avoid burnout. <strong>🎯 Lucky Months & Numbers:</strong> March, July, November | Numbers: 1, 4, 7. <strong>🌟 Quick Tip:</strong> Trust your instincts and lead with courage."
    ],
    "2": [
            "<strong>✨ Yearly Vibe:</strong> This year highlights harmony, patience, and emotional balance. Partnerships will be key to your growth. <strong>💼 Career & Money:</strong> Collaboration will bring success; avoid conflicts at the workplace. Financially, steady gains come with careful planning. <strong>💖 Relationships:</strong> Strengthen emotional bonds—communication will be your power. Singles may attract a soulmate through kindness. <strong>🧘 Health Tip:</strong> Manage stress by focusing on mindfulness or yoga. <strong>🎯 Lucky Months & Numbers:</strong> February, June, October | Numbers: 2, 6, 7. <strong>🌟 Quick Tip:</strong> Build connections that matter—teamwork will take you far."
    ],
    "3": [
            "<strong>✨ Yearly Vibe:</strong> A creative and expressive year awaits you. Communication and social activities will bring exciting opportunities. <strong>💼 Career & Money:</strong> Innovative ideas will lead to recognition. Financially, invest in learning or personal growth. <strong>💖 Relationships:</strong> Your charm will make your love life sparkle—romantic encounters are likely. <strong>🧘 Health Tip:</strong> Balance your high energy with proper rest to avoid over-exhaustion. <strong>🎯 Lucky Months & Numbers:</strong> January, April, December | Numbers: 3, 6, 9. <strong>🌟 Quick Tip:</strong> Let your creativity shine and inspire others."
    ],
    "4": [
            "<strong>✨ Yearly Vibe:</strong> A year of discipline, planning, and strong foundations. Your hard work will bring long-term rewards. <strong>💼 Career & Money:</strong> Focus on structured projects and building stability. Avoid shortcuts. Financially, steady progress is promised. <strong>💖 Relationships:</strong> Show commitment and reliability in your relationships. <strong>🧘 Health Tip:</strong> Regular exercise and a consistent routine will boost your energy. <strong>🎯 Lucky Months & Numbers:</strong> March, August, December | Numbers: 4, 1, 8. <strong>🌟 Quick Tip:</strong> Consistency is your biggest strength—keep moving step by step."
    ],
    "5": [
            "<strong>✨ Yearly Vibe:</strong> Change, adventure, and freedom dominate this year. Expect surprises and opportunities that push you beyond your comfort zone. <strong>💼 Career & Money:</strong> Travel or dynamic projects can bring growth. Avoid impulsive financial decisions. <strong>💖 Relationships:</strong> Love life will be exciting but needs honesty and clarity. <strong>🧘 Health Tip:</strong> Keep your mind and body active with outdoor activities. <strong>🎯 Lucky Months & Numbers:</strong> May, July, October | Numbers: 5, 3, 6. <strong>🌟 Quick Tip:</strong> Embrace flexibility—this year rewards those who adapt fast."
    ],
    "6": [
            "<strong>✨ Yearly Vibe:</strong> Family, love, and responsibility will define your year. Creating harmony at home and work is your key goal. <strong>💼 Career & Money:</strong> Projects involving care, service, or creativity will flourish. Financial gains are likely through balanced planning. <strong>💖 Relationships:</strong> Love deepens as you show compassion and care. Singles may meet someone who values stability. <strong>🧘 Health Tip:</strong> Focus on emotional well-being and avoid stress overload. <strong>🎯 Lucky Months & Numbers:</strong> February, June, September | Numbers: 6, 2, 3. <strong>🌟 Quick Tip:</strong> Balance giving with receiving—self-care is just as important."
    ],
    "7": [
            "<strong>✨ Yearly Vibe:</strong> This year is about introspection, learning, and spiritual growth. Take time to plan and analyze before making big decisions. <strong>💼 Career & Money:</strong> Focus on research or skill-building. Avoid hasty financial investments. <strong>💖 Relationships:</strong> You may crave space, but honest communication will keep relationships strong. <strong>🧘 Health Tip:</strong> Meditation and mindfulness will bring clarity and peace. <strong>🎯 Lucky Months & Numbers:</strong> April, August, November | Numbers: 7, 2, 9. <strong>🌟 Quick Tip:</strong> Trust your inner wisdom—quiet reflection leads to breakthroughs."
    ],
    "8": [
            "<strong>✨ Yearly Vibe:</strong> Power, ambition, and success are your keywords this year. You will feel driven to achieve big goals. <strong>💼 Career & Money:</strong> Leadership roles and strategic planning will bring success. Financial gains are possible through smart moves. <strong>💖 Relationships:</strong> Balance ambition with emotional connection to avoid conflicts. <strong>🧘 Health Tip:</strong> Avoid stress from overworking—prioritize mental rest. <strong>🎯 Lucky Months & Numbers:</strong> March, September, December | Numbers: 8, 1, 4. <strong>🌟 Quick Tip:</strong> Stay focused and disciplined—your hard work will be rewarded."
    ],
    "9": [
            "<strong>✨ Yearly Vibe:</strong> Compassion, closure, and transformation define your year. It’s time to let go of what no longer serves you. <strong>💼 Career & Money:</strong> Completing old projects will bring success. Financially, generosity and helping others will bring positive energy. <strong>💖 Relationships:</strong> Emotional healing and forgiveness will improve connections. <strong>🧘 Health Tip:</strong> Focus on mental wellness—practice gratitude and positivity. <strong>🎯 Lucky Months & Numbers:</strong> January, May, October | Numbers: 9, 3, 6. <strong>🌟 Quick Tip:</strong> Release old baggage and welcome fresh beginnings."
    ]
}
