{
    "1": [
          "<strong>✨ Yearly Vibe:</strong> This year is all about new beginnings, leadership, and stepping confidently into your power. The energy around you supports growth, ambition, and self-discovery. It's the perfect year to take charge of your destiny, set ambitious goals, and break free from past limitations. Opportunities for personal and professional advancement will present themselves if you dare to act boldly. Trust your instincts, as your decisions will shape the long-term path of success. <strong>💼 Career & Money:</strong> Professionally, this is a year to take initiative—whether it’s launching a new project, changing career paths, or stepping into a leadership role. Your determination and courage will earn recognition. Financially, the first half of the year may require careful planning and saving, but the latter half promises rewards for your hard work. Invest wisely and avoid unnecessary risks; instead, focus on long-term stability and creating multiple income streams. <strong>💖 Relationships:</strong> Relationships may go through a phase of transformation this year. If you’re in a relationship, your partner will look up to your confidence and decisiveness. Show appreciation and avoid being overly authoritative. For singles, new romantic opportunities may arise through professional or social networks, especially in the second half of the year. This is also a year to deepen emotional connections with family and close friends by being more expressive about your feelings. <strong>🧘 Health Tip:</strong> While your drive and energy will be high, there is a risk of overexertion if you don’t maintain balance. Incorporate relaxation techniques like yoga, meditation, or nature walks into your routine. Watch for signs of stress, headaches, or fatigue due to long working hours. Prioritizing mental wellness will be as important as physical fitness this year. <strong>🎯 Lucky Months & Numbers:</strong> March, July, and November are particularly powerful for launching initiatives, making career changes, or pursuing personal goals. Numbers 1, 4, and 7 will bring luck and clarity throughout the year. <strong>🌟 Quick Tip:</strong> Take ownership of your journey—this is the year to carve your own path and not wait for approval. Your confidence and bold steps will shape your success in remarkable ways."
    ],
    "2": [
        "🌟 This is a year of patience, partnership, and internal healing. You’re being invited to collaborate, nurture relationships, and allow life to unfold slowly and gracefully.",
        "💡 Harmony is your superpower this year. You’ll find more joy in gentle presence than grand moves. Let emotions guide your path without overwhelming your decisions.",
        "🚀 2025 helps you develop emotional intelligence and deep compassion. Focus on building emotional security in relationships and resolve lingering issues through peace and empathy."
    ],
    "3": [
        "🌟 This is your year of expression, creativity, and joyful expansion. Use your voice—through writing, speaking, or artistry—to connect and shine.",
        "💡 You’re more magnetic than ever. Opportunities in social settings, public speaking, and art will flourish. Keep your energy high by doing what you love.",
        "🚀 Let fun be your medicine. Don't suppress your natural exuberance. Share your message and inspire others through storytelling, creativity, and lightness."
    ],
    "4": [
        "🌟 This year calls for structure, commitment, and focused discipline. You’re building a solid foundation—brick by brick—for the years to come.",
        "💡 Not the flashiest year, but one of the most important. Stick to your routines, develop healthy habits, and lay down long-term strategies. It’s harvest season for hard work.",
        "🚀 Delayed gratification is your key to success. Embrace the grind, avoid shortcuts, and remember: real progress takes time. You’re creating something lasting."
    ],
    "5": [
        "🌟 Get ready for change. 2025 will test your adaptability and encourage you to embrace freedom, movement, and exploration.",
        "💡 This year may feel chaotic if you resist change. Go with the flow—travel, learn new skills, meet new people. Say yes more often than no.",
        "🚀 Expect the unexpected. From job shifts to relationship turns, everything is in motion. But if you dance with change, it can be your biggest breakthrough."
    ],
    "6": [
        "🌟 This is a year of home, family, responsibility, and heart-centered service. Relationships will demand attention—and give back emotional fulfillment.",
        "💡 Care for others, but don't neglect your own boundaries. You may take on extra roles in family or community—be sure to prioritize self-care too.",
        "🚀 Love and responsibility go hand in hand this year. Whether through parenting, mentoring, or support roles—you’re becoming a safe space for others."
    ],
    "7": [
        "🌟 Time to go inward. 2025 brings reflection, study, spirituality, and a quest for deeper meaning. You’ll thrive in silence, solitude, and introspection.",
        "💡 Resist the urge to prove anything externally. Your power lies in insight, not approval. Read, meditate, and slow down to speed up in the long run.",
        "🚀 A sacred year to upgrade your soul. You may explore mystical teachings, sacred texts, or hidden truths that shift your entire worldview. Allow transformation through stillness."
    ],
    "8": [
        "🌟 Power, ambition, and financial elevation define your 2025. This is a year to climb, command, and cash in on your skills.",
        "💡 Business, promotions, recognition—all are possible. But leadership must come with integrity. Don’t chase status at the cost of self-respect.",
        "🚀 Step into the spotlight. You are capable of commanding great results—but only if you stay focused and ethical. Manifestation is strongest this year."
    ],
    "9": [
        "🌟 The end of a 9-year cycle. 2025 is about release, reflection, and spiritual completion. What no longer serves you must go.",
        "💡 This is not a year to start new things, but to bring closure with grace. End relationships, habits, and mindsets that are expired.",
        "🚀 Through endings, new clarity is born. Let yourself grieve, forgive, and move forward. 2025 completes your transformation—2026 will be your new beginning."
    ]
}
