{
  "life_path": {
    "1": "By Nature you are independent, ambitious, and naturally like to lead. You have strong willpower, fresh ideas, and prefer doing things your own way. You are confident and determined, though at times you may become stubborn, bossy, or too focused on yourself. Criticism feels tough, but appreciation lifts your spirit and motivates you.",
    "2": "By Nature you are gentle, kind, and peace-loving. You enjoy working with others and dislike conflicts. People trust you because you listen and care. At times you may be shy, sensitive, or dependent on others, but y",
    "3": "By Nature you are cheerful, expressive, and creative. You enjoy talking, entertaining, and spreading joy wherever you go. People are drawn to your positive energy. Sometimes you get distracted, careless, or waste time, but when you stay focused, you use your talent to inspire others and bring happiness around you.",
    "4": "By Nature you are practical, hardworking, and reliable. You like stability and prefer to build life step by step. People see you as trustworthy and disciplined. Sometimes you may be stubborn, too serious, or rigid, but when you stay patient and organized, you create lasting security and long-term success for yourself and others.",
    "5": "By Nature you are adventurous, curious, and love freedom. You enjoy travel, change, and new experiences. People see you as fun, lively, and exciting. Sometimes you may feel restless, careless, or avoid commitment, but when you direct your energy wisely, you create a colorful, inspiring, and truly fulfilling life.",
    "6": "By Nature you are caring, loving, and protective. Family, relationships, and harmony are very important to you. People trust you because you are supportive and responsible. Sometimes you may worry too much or try to control things, but when you balance yourself, you spread peace, love, and happiness wherever you go.",
    "7": "By Nature you are thoughtful, spiritual, and love learning. You like to think deeply, enjoy your own space, and search for life’s truths. People may see you as quiet or mysterious. At times you can be too reserved or doubtful, but when you trust yourself, you find wisdom and inspire others with your insights.",
    "8": "By Nature you are ambitious, strong, and focused on success. You are good at managing money, business, and leadership roles. People admire your discipline and determination. Sometimes you may be bossy, materialistic, or work too much, but when you balance power with fairness, you achieve great success and lasting respect.",
    "9": "By Nature you are kind, generous, and compassionate. You care deeply about people and want to make the world a better place. People see you as inspiring and creative. At times you may feel emotional, disappointed, or give too much, but when you balance your heart, you shine as a guide and bring comfort to others."
  },
  "heart_number": {
    "1": "You deeply desire independence, recognition, and the freedom to live life on your own terms. You want to stand out, be admired for your abilities, and lead rather than follow. Deep inside, your heart pushes you to be courageous, strong, and original in everything you do. You dislike depending on others and feel happiest when you are achieving something by yourself. Success, self-expression, and personal power are what your soul truly craves.",
    "2": "Your inner desire is to love and be loved, to live in peace, and to build harmony in your surroundings. You naturally crave companionship, closeness, and emotional connection. Your heart longs for understanding, balance, and cooperation rather than competition. You dislike conflict and often dream of a life where kindness and trust are always present. True happiness comes when you are supported by relationships that give you stability, care, and mutual respect.",
    "3": "Your long for joy, freedom of expression, and a playful life. Deep down, your heart wants to create, laugh, and live colorfully without heavy restrictions. You crave opportunities to use your voice, your imagination, and your creativity to inspire others. You dislike dull routines and feel alive when you are surrounded by fun, friends, and beauty. Your soul is happiest when you are expressing yourself openly and spreading positivity to the world.",
    "4": "Your deepest desire is to create stability, structure, and security in life. You want to build strong foundations—whether it’s in career, family, or relationships—and you feel safe when everything is organized and reliable. Your heart craves honesty, hard work, and practical achievements that last a lifetime. You dislike chaos and uncertainty, preferring a steady path that ensures peace of mind. Your soul is most satisfied when you achieve long-term success through discipline and patience.",
    "5": "Your heart truly longs for freedom, adventure, and variety. You want to experience life fully, exploring new places, meeting new people, and learning new things. Deep down, you dislike being stuck in routines or strict rules, and you crave movement and excitement. Your inner desire is to live spontaneously and without limitations. You feel happiest when you have the freedom to make your own choices and enjoy life with passion, growth, and exploration.",
    "6": "Your deepest desire is to love, care, and protect. You want to create a happy, harmonious home filled with warmth and affection. Your heart longs for family, close relationships, and the responsibility of taking care of others. You dislike selfishness and chaos, preferring to bring balance and peace wherever you go. Deep inside, you feel happiest when you are needed, trusted, and able to support the people you love with kindness and devotion.",
    "7": "You truly desire wisdom, inner peace, and spiritual growth. Your heart craves knowledge, truth, and a deeper understanding of life’s mysteries. You enjoy solitude and reflection, often searching within for answers. You dislike shallow connections or meaningless routines, preferring quality over quantity in everything. Deep inside, your soul feels most fulfilled when you are learning, meditating, or exploring your spiritual path. What you truly want is clarity, self-awareness, and a strong inner connection.",
    "8": "Your inner desire is for success, recognition, and material security. You want power, influence, and the ability to achieve big goals. Deep down, you crave the respect that comes from accomplishment and financial strength. You dislike weakness or failure, preferring a life where you can stand tall and be admired. Your soul feels most satisfied when you are in control, reaching high positions, and turning your ambitions into reality with discipline and determination.",
    "9": "Your deepest desire is to help others, spread kindness, and make the world a better place. You long for compassion, generosity, and emotional connection with people. Deep inside, your heart craves a life full of love, service, and creativity. You dislike selfishness or cruelty, preferring to use your energy for healing and uplifting others. Your soul feels happiest when you give back, inspire hope, and use your talents to bring light and comfort to humanity.
"
  },
  "annual_vibration": {
    "1": "✨ This year feels like a fresh start for you. It’s the beginning of a new 9-year cycle, so think of it as planting seeds for the future. You will feel more confident, ambitious, and ready to do things your own way instead of depending on others. New opportunities will come your way, and you may feel a strong push to start something different — whether it’s a career path, relationship, or personal goal. The energy around you is encouraging you to take bold steps and make decisions that can shape your future for many years. At times, you might feel impatient or restless, but that’s just your inner drive pushing you forward. Don’t waste too much time thinking about the past — it’s over. Focus instead on creating a solid foundation for your dreams. This is also a year where your individuality will shine, so don’t be afraid to stand out or take the lead. Just remember, success comes when you mix confidence with discipline. Take action, trust yourself, and keep moving forward, because this is the year to set the tone for the next chapter of your life.",
    "2": "🤝 This year is slower and softer compared to last year. Instead of rushing forward, you will notice that life asks you to be more patient, calm, and cooperative. It’s a year where relationships, friendships, and teamwork matter more than your personal ambitions. You may feel extra sensitive, emotional, or even doubtful about yourself at times, but that’s normal because this year’s energy is about balance and harmony. Don’t try to force things or make huge changes too quickly — progress will come, but in small steps. Your listening skills, kindness, and ability to work with others will bring you more success than trying to do everything alone. Love, companionship, and partnerships may play an important role this year, so pay attention to the people around you. You may also need to handle misunderstandings carefully and avoid unnecessary arguments. If you stay patient, opportunities will show up in the right time. Think of this year as a time to build stronger connections, improve your relationships, and lay the groundwork for long-term growth. You are learning to trust the process, cooperate with others, and allow life to move forward naturally without rushing.",
    "3": "🎨 This year brings more fun, creativity, and self-expression into your life. After the slower pace of last year, now you feel lighter and more social. You may find yourself wanting to meet new people, make friends, or spend more time enjoying life instead of just working hard. Creativity is highlighted, so if you love art, writing, speaking, or anything that allows you to express yourself, this is the perfect time to explore it. You may also feel more confident sharing your thoughts and ideas with others, and your communication skills will attract the right kind of people. Travel, parties, and social gatherings may play a big role, helping you expand your circle. However, one warning — don’t waste too much energy on distractions, gossip, or superficial fun. Balance enjoyment with responsibility. Emotionally, you may feel happier and more optimistic, but sometimes mood swings could appear if you take things too personally. Overall, this is a year to laugh more, create more, and enjoy the simple pleasures of life. Let your imagination flow, express your talents, and build joyful connections that can help you both personally and professionally.",
    "4": "🏗️ This year is about hard work, discipline, and building a strong foundation for your future. Unlike last year’s fun and light energy, this time you’ll need to focus on stability, planning, and putting in consistent effort. You may feel like responsibilities are heavier, but this is exactly what helps you grow. Think of this year as laying bricks for a strong house — the more effort you put in now, the more secure your future will be. You might need to pay attention to money, health, or long-term goals, and it’s important to stay practical instead of chasing quick results. At times, life may feel a little slow or restricted, but don’t let that discourage you. Patience and determination are your biggest tools this year. Try to stay organized, make a routine, and follow through with your plans step by step. Relationships may also require effort, especially when it comes to trust and reliability. Remember, this year is not about instant rewards but about creating a structure that will support your dreams in the coming years. Stay focused, stay disciplined, and keep working hard — your efforts will pay off in the long run.",
    "5": "🌪️ This year brings freedom, change, and excitement into your life. After all the discipline of last year, now you will feel like breaking free from routine and trying new things. Adventure, travel, and new opportunities are highlighted. You may experience sudden changes in career, relationships, or personal life, and while these changes may feel unexpected, they will open doors to growth. Flexibility is the key this year — the more open you are to change, the more you will benefit. You may also feel more curious, playful, and eager to take risks. Be careful not to scatter your energy in too many directions or get carried away by temptations, because this year can make you restless. Focus on using your freedom wisely. Meet new people, explore new hobbies, and embrace experiences that expand your mind. Romance and social life may feel more exciting, but don’t rush into commitments too quickly. This is a year to experiment, explore, and enjoy variety, but also to learn self-control. The best part? Life feels fresh, adventurous, and full of possibilities. Use this time to discover what truly excites you and opens new paths for your future.",
    "6": "🏡 This year focuses on love, family, and responsibilities. You may feel more connected to your home and relationships, and your heart will be drawn toward caring for others. It’s a year where balance between personal and family life becomes important. Marriage, partnerships, or commitments may come into focus, and you’ll feel the need to build harmony in your surroundings. At the same time, responsibilities at home or work may increase, and you might need to take care of loved ones or deal with family matters more seriously. Don’t see this as a burden — it’s a chance to create stronger bonds and a more stable life. Creativity and beauty are also highlighted, so you may feel inspired to improve your home, surroundings, or lifestyle. Emotional connections are very important this year, and honesty in relationships will bring you peace. On the flip side, avoid being too controlling or sacrificing too much for others — remember to care for yourself as well. Overall, this is a year of love, compassion, and healing. You are being guided to strengthen your relationships, accept your responsibilities gracefully, and create a life that feels peaceful and supportive.",
    "7": "🔮 This year is more about inner growth, reflection, and self-discovery. Life slows down a little, giving you space to think deeply about yourself and your path. You may feel less social or less interested in running after material things, and more drawn toward learning, spirituality, or spending quiet time alone. This is not the year to push too hard for results in the outside world; instead, it’s about understanding yourself on a deeper level. You may find yourself reading, studying, meditating, or simply analyzing life more carefully. At times, you might feel lonely or misunderstood, but remember this is a year of inner growth, not outer recognition. Trust your intuition, because your inner voice will be stronger than usual. Work or career may not move as fast as you’d like, but behind the scenes, you are building wisdom that will guide your future. Relationships may also test you, teaching you patience and trust. See this year as a pause, like a rest stop where you recharge your energy and gain clarity. The lessons you learn now will help you create a stronger and wiser version of yourself for the years to come.",
    "8": "💼 This year is about success, power, and achievements. After all the inner growth of last year, now the focus shifts back to the material world — career, money, and authority. You may see opportunities to advance in your profession, take leadership roles, or attract financial rewards. This is a year where your hard work can finally pay off, but it also demands discipline and responsibility. Think big, act with confidence, and don’t be afraid to take charge. At the same time, be careful not to become too controlling, materialistic, or power-hungry. Balance is important — use your success to help others as well. Financial matters may improve, but you’ll need to manage them wisely. This year can bring recognition, promotions, or big career moves, depending on how much effort you’ve put in during the past years. Relationships may require balance too, as your busy schedule might affect personal connections. Stay grounded and humble, even while reaching for higher goals. This is your time to step into your strength, prove your abilities, and create stability in the material world. Remember, success comes with responsibility, so use your power wisely and stay true to your values.",
    "9": "🌕 This year is about endings, completion, and letting go. It’s the final chapter of your 9-year cycle, so life will encourage you to release what no longer serves you. Old habits, toxic relationships, or unfinished matters may come to the surface, asking you to finally close those doors. At times, you may feel emotional or nostalgic, but remember this clearing is making space for new beginnings next year. Forgiveness, compassion, and acceptance play a big role this year. You may find yourself helping others, serving your community, or simply feeling more connected to humanity. Career or personal goals may reach a conclusion, and it’s a good time to tie up loose ends rather than start something brand new. Relationships may transform, with some people leaving and new connections preparing to enter your life. This year teaches you the beauty of endings — they are not failures, but steps toward something fresh. Focus on healing, gratitude, and preparing yourself emotionally and mentally for a new cycle. By the end of this year, you’ll feel lighter, wiser, and ready for the new beginnings waiting for you in the next Year."
  },
  "quote": "“A birthday is not just a date. It’s the beginning of a fresh orbit — around the sun, and around your own growth.”"
}
