{
  "1": {
    "single": "<ul><li><strong>Sun</strong> is boosting your confidence and desire to lead. You feel ready to step into the spotlight and claim what’s yours.</li><li>People around you notice your energy — use this to push forward with bold ideas or career moves.</li><li>Don’t let pride or ego spoil this moment; pair your confidence with humility for lasting success.</li></ul>",
    "double": "<ul><li><strong>Sun</strong> energy is burning brighter, making you fiercely independent and ambitious.</li><li>You want to do things your way, but remember that collaboration often brings bigger wins.</li><li>Focus on leadership with kindness; a small act of gratitude can open new doors for you.</li></ul>",
    "multiple": "<ul><li>Too much <strong>Sun</strong> energy can make you restless or overly competitive.</li><li>Watch out for arguments or ego battles — especially with people close to you.</li><li>Channel this fiery energy into projects that truly excite you, rather than proving a point.</li></ul>"
  },
  "2": {
    "single": "<ul><li><strong>Moon</strong> is stirring your heart, making you deeply sensitive and empathetic.</li><li>Your relationships take center stage — even a small emotional gesture can feel profound now.</li><li>Express your feelings and listen to your loved ones; emotional honesty will bring you closer.</li></ul>",
    "double": "<ul><li><strong>Moon</strong> is doubling your emotional tides — you might crave love, care, or reassurance.</li><li>This is a powerful time for heart-to-heart conversations, but don’t overthink or assume.</li><li>Focus on trust and vulnerability; opening up will strengthen your emotional bonds.</li></ul>",
    "multiple": "<ul><li>Too much <strong>Moon</strong> energy may leave you overwhelmed or emotionally drained.</li><li>Don’t carry the weight of everyone’s feelings — practice healthy emotional boundaries.</li><li>Spend time in nature or journal your thoughts to bring emotional clarity.</li></ul>"
  },
  "3": {
    "single": "<ul><li><strong>Jupiter</strong> is lighting up your creativity and communication skills.</li><li>You might feel inspired to express yourself — through writing, art, or meaningful conversations.</li><li>Use this spark to share your ideas; your charm can attract opportunities and admiration.</li></ul>",
    "double": "<ul><li><strong>Jupiter</strong> doubles your expressive energy — ideas flow like a river, but they might feel scattered.</li><li>Take a moment to focus on one dream or goal at a time for better results.</li><li>Networking or public speaking could bring unexpected recognition now.</li></ul>",
    "multiple": "<ul><li>Too much <strong>Jupiter</strong> energy might make you restless or overconfident.</li><li>Ground yourself by organizing your thoughts and avoiding impulsive promises.</li><li>Use this creative surge to start something meaningful and long-lasting.</li></ul>"
  },
  "4": {
    "single": "<ul><li><strong>Rahu</strong> is asking you to create structure and discipline in your life.</li><li>You may feel the urge to organize your work, finances, or personal life for long-term stability.</li><li>Focus on building a strong foundation rather than chasing quick results.</li></ul>",
    "double": "<ul><li><strong>Rahu</strong> doubles your need for control and perfection.</li><li>While your focus can bring achievements, don’t be too harsh on yourself or others.</li><li>Balance discipline with flexibility to avoid burnout.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Rahu</strong> energy can bring stress or a feeling of being stuck.</li><li>Let go of things you can’t control and focus on what truly matters.</li><li>Take small breaks to clear your mind and return stronger.</li></ul>"
  },
  "5": {
    "single": "<ul><li><strong>Mercury</strong> is bringing curiosity and a thirst for new experiences.</li><li>You may feel adventurous, wanting to explore, learn, or meet new people.</li><li>Follow your curiosity but think twice before making sudden decisions.</li></ul>",
    "double": "<ul><li><strong>Mercury</strong> doubles your restless energy — routines may feel suffocating.</li><li>You might feel pulled toward exciting changes or experiments.</li><li>Stay grounded and ensure your choices align with long-term goals.</li></ul>",
    "multiple": "<ul><li>Too much <strong>Mercury</strong> energy can create chaos or confusion.</li><li>Slow down and take one step at a time.</li><li>Use this adventurous spirit to learn something valuable or expand your horizons.</li></ul>"
  },
  "6": {
    "single": "<ul><li><strong>Venus</strong> shifts your focus toward love, family, and personal happiness.</li><li>You might feel drawn to creating a warm and beautiful environment around you.</li><li>This is a perfect time to heal relationships and bring harmony to your personal life.</li></ul>",
    "double": "<ul><li><strong>Venus</strong> doubles your caring energy — you want to shower love on those who matter.</li><li>Be mindful of expectations; give love without waiting for immediate returns.</li><li>Spend quality time with family or do something creative together.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Venus</strong> energy can make you overly emotional or attached.</li><li>Don’t lose yourself while trying to please everyone.</li><li>Balance self-love with care for others.</li></ul>"
  },
  "7": {
    "single": "<ul><li><strong>Ketu</strong> is guiding you inward, making you thoughtful and introspective.</li><li>You may seek quiet moments to reflect on life’s deeper meaning.</li><li>This is a great time for meditation, journaling, or spiritual exploration.</li></ul>",
    "double": "<ul><li><strong>Ketu</strong> doubles your quest for truth and clarity.</li><li>Spending time alone can bring breakthroughs, but avoid disconnecting from reality.</li><li>Use your intuition to make wise decisions now.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Ketu</strong> energy can make you detached or overly withdrawn.</li><li>Don’t ignore people who care for you — balance solitude with connection.</li><li>Channel your inner thoughts into something creative or healing.</li></ul>"
  },
  "8": {
    "single": "<ul><li><strong>Saturn</strong> is testing your discipline and patience, but rewards are on the way.</li><li>Your career and financial stability require hard work and focus now.</li><li>Stay consistent and avoid shortcuts — long-term success is being built step by step.</li></ul>",
    "double": "<ul><li><strong>Saturn</strong> doubles the responsibilities on your shoulders.</li><li>Challenges may slow you down, but each step is building a strong future.</li><li>Trust the process, plan carefully, and keep moving forward.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Saturn</strong> energy can bring stress or power struggles.</li><li>Take breaks, meditate, or talk to a mentor to release pressure.</li><li>Stay calm and focus on steady progress rather than quick wins.</li></ul>"
  },
  "9": {
    "single": "<ul><li><strong>Mars</strong> is filling you with passion, courage, and determination.</li><li>You are ready to let go of past baggage and fight for what truly matters.</li><li>Use this energy to pursue goals fearlessly but avoid unnecessary conflicts.</li></ul>",
    "double": "<ul><li><strong>Mars</strong> doubles your intensity and emotional drive.</li><li>This can be a powerful time for career breakthroughs or personal transformation.</li><li>Keep your temper in check and use this fire to build, not burn bridges.</li></ul>",
    "multiple": "<ul><li>Too much <strong>Mars</strong> energy can make you impulsive or aggressive.</li><li>Pause before reacting — your strength lies in controlled action.</li><li>Channel your passion into fitness, career projects, or creative ventures.</li></ul>"
  }
}
