{
  "1": {
    "single": "<ul><li><strong>Sun</strong> brings a spark to take bold initiatives and lead with confidence.</li><li>Your self-belief is high, pushing you to step out of your comfort zone.</li><li>Ideal time to begin projects that showcase your individuality and ambition.</li></ul>",
    "double": "<ul><li><strong>Sun</strong> energy doubles your desire for independence and authority.</li><li>You want to lead and make decisions your own way.</li><li>Ensure this enthusiasm doesn’t turn into impatience or ego-driven actions.</li></ul>",
    "multiple": "<ul><li>Multiple influences of <strong>Sun</strong> can bring restlessness or ego clashes.</li><li>Avoid forcing your vision if others don’t align.</li><li>Channel this fiery confidence into constructive leadership tasks.</li></ul>"
  },
  "2": {
    "single": "<ul><li><strong>Moon</strong> enhances emotional sensitivity and deep connections.</li><li>Conversations feel meaningful and build harmony with others.</li><li>A good time to create trust and nurture close bonds.</li></ul>",
    "double": "<ul><li><strong>Moon</strong> energy amplifies your emotional needs and sensitivity.</li><li>Small misunderstandings can hurt more, so communicate openly.</li><li>Stay balanced and avoid over-dependence on others.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Moon</strong> energy can bring confusion and mood swings.</li><li>Avoid absorbing too many emotions of others.</li><li>Focus on self-care and emotional balance.</li></ul>"
  },
  "3": {
    "single": "<ul><li><strong>Jupiter</strong> boosts creativity, expression, and optimism.</li><li>Your ideas and words flow effortlessly, inspiring others.</li><li>Perfect time for writing, public speaking, or artistic pursuits.</li></ul>",
    "double": "<ul><li><strong>Jupiter</strong> doubles your charm and creativity, attracting admiration.</li><li>Too many ideas can scatter your focus.</li><li>Channel your energy into one strong plan for better results.</li></ul>",
    "multiple": "<ul><li>Multiple <strong>Jupiter</strong> influences may cause restlessness or shallow communication.</li><li>Slow down and bring depth to your creative expression.</li><li>Focus on quality rather than rushing through everything.</li></ul>"
  },
  "4": {
    "single": "<ul><li><strong>Rahu</strong> encourages discipline and structure in life.</li><li>You feel motivated to create stability and order around you.</li><li>Hard work and focus will lead to long-term growth.</li></ul>",
    "double": "<ul><li><strong>Rahu</strong> energy doubles your drive for perfection.</li><li>You might push yourself beyond limits to get things done.</li><li>Stay flexible and avoid being overly critical of others.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Rahu</strong> energy can lead to stress and over-controlling tendencies.</li><li>Learn to relax and adapt rather than forcing outcomes.</li><li>Balance work with self-care.</li></ul>"
  },
  "5": {
    "single": "<ul><li><strong>Mercury</strong> brings curiosity, adventure, and change.</li><li>You are eager to explore new opportunities or experiences.</li><li>Perfect time to learn, travel, or experiment with creative ideas.</li></ul>",
    "double": "<ul><li><strong>Mercury</strong> energy heightens your need for excitement and variety.</li><li>Routines might feel boring, but avoid impulsive decisions.</li><li>Think carefully before making sudden changes.</li></ul>",
    "multiple": "<ul><li>Too much <strong>Mercury</strong> energy can bring chaos and lack of focus.</li><li>Stay grounded and plan your actions carefully.</li><li>Channel this energy into meaningful adventures.</li></ul>"
  },
  "6": {
    "single": "<ul><li><strong>Venus</strong> shifts focus towards love, family, and harmony.</li><li>You feel caring and protective of your loved ones.</li><li>Perfect phase for improving relationships and home life.</li></ul>",
    "double": "<ul><li><strong>Venus</strong> energy doubles your affection and emotional warmth.</li><li>You may expect the same love in return, leading to disappointments.</li><li>Balance your expectations with self-love.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Venus</strong> energy can make you emotionally heavy or overly attached.</li><li>Maintain personal boundaries while caring for others.</li><li>Don’t forget to take care of yourself too.</li></ul>"
  },
  "7": {
    "single": "<ul><li><strong>Ketu</strong> enhances introspection and spiritual thinking.</li><li>You may seek solitude to reflect and grow mentally.</li><li>A good time for meditation, study, and self-discovery.</li></ul>",
    "double": "<ul><li><strong>Ketu</strong> energy doubles your quest for answers.</li><li>You may dive deeper into spiritual or research-oriented fields.</li><li>Solitude feels refreshing but maintain balance with the outer world.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Ketu</strong> energy may make you overly detached.</li><li>Don’t get lost in overthinking or isolation.</li><li>Balance inner reflection with real-world actions.</li></ul>"
  },
  "8": {
    "single": "<ul><li><strong>Saturn</strong> emphasizes career, discipline, and financial stability.</li><li>Your determination helps in building long-term success.</li><li>Patience and consistent efforts will pay off.</li></ul>",
    "double": "<ul><li><strong>Saturn</strong> energy doubles your sense of responsibility.</li><li>Tasks may feel heavy, but persistence will lead to rewards.</li><li>Stay calm and avoid taking unnecessary pressure.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Saturn</strong> energy can cause stress and conflicts.</li><li>Avoid power struggles and focus on steady progress.</li><li>Keep a balance between work and relaxation.</li></ul>"
  },
  "9": {
    "single": "<ul><li><strong>Mars</strong> increases compassion, strength, and emotional healing.</li><li>You are ready to let go of past baggage.</li><li>Perfect time for helping others and practicing forgiveness.</li></ul>",
    "double": "<ul><li><strong>Mars</strong> energy doubles emotional intensity and courage.</li><li>You may feel driven to resolve past issues or take bold steps.</li><li>Use this energy for constructive changes.</li></ul>",
    "multiple": "<ul><li>Excess <strong>Mars</strong> energy can cause emotional exhaustion.</li><li>Focus on self-healing and avoid taking on too many responsibilities.</li><li>Channel your passion wisely.</li></ul>"
  }
}
