{
  "1": {
    "single": "You are feeling a spark to start something new, whether it’s a fresh idea or a personal step you’ve been thinking about for a while. Your confidence is building up to take the first move.",
    "double": "Your desire for independence is strong — you want things your way, even if it means taking bold steps. Just ensure your excitement doesn’t turn into impulsive decisions.",
    "multiple": "Too many 1s can bring ego clashes or restlessness. You may feel frustrated if others don’t see your vision, so balance your confidence with patience."
  },
  "2": {
    "single": "Your emotional side is more active these days, making you value close conversations and deep connections. You naturally want harmony with those around you.",
    "double": "You are feeling highly sensitive and want reassurance in love or friendships. Misunderstandings might bother you, so talk openly.",
    "multiple": "Too much 2 energy may create emotional confusion or overthinking. Focus on self-care and don’t let your emotions cloud your judgment."
  },
  "3": {
    "single": "You feel more expressive and creative — your ideas and words are flowing naturally, making you want to share them with the world.",
    "double": "Your charm and creativity are doubled, but you may feel scattered with too many ideas. Focus on one plan at a time.",
    "multiple": "Multiple 3s can make you restless and distracted. Use this energy for meaningful communication rather than wasting it."
  },
  "4": {
    "single": "You are feeling the need for discipline and stability. Both at home and work, you are trying to bring structure and focus into your tasks.",
    "double": "Your desire for perfection is strong — you want everything to be done your way, and you are pushing your boundaries to achieve it.",
    "multiple": "Too much 4 energy can create stress and stubbornness. Learn to relax and adapt instead of over-controlling situations."
  },
  "5": {
    "single": "Your mind is craving change and new experiences. You may feel drawn towards exploring new opportunities or adventures.",
    "double": "Your restless energy is high — you want something exciting and different, but think twice before taking sudden risks.",
    "multiple": "Too many 5s can bring chaos or confusion. Stay grounded and avoid impulsive decisions."
  },
  "6": {
    "single": "Your focus is shifting towards love, family, and home. You want to create balance and harmony in your personal life.",
    "double": "You are feeling extra caring and emotional these days, sometimes expecting the same love in return.",
    "multiple": "Too much 6 energy may make you emotionally heavy or over-involved. Learn to maintain balance between self-care and caring for others."
  },
  "7": {
    "single": "You are becoming more reflective and thoughtful. A deeper understanding of life is shaping your decisions.",
    "double": "You feel an urge to find answers and meaning in your current journey, often preferring solitude.",
    "multiple": "Too many 7s may make you detached or lost in thoughts. Keep a balance between your inner world and reality."
  },
  "8": {
    "single": "You are focusing on career, financial growth, and building stability for the future.",
    "double": "Your ambition is high, and responsibilities feel heavy — but this phase can bring strong results with patience.",
    "multiple": "Too much 8 energy may lead to power struggles, stress, or overwork. Keep calm and avoid ego-driven decisions."
  },
  "9": {
    "single": "You are becoming more compassionate and thoughtful. Emotional healing and letting go of past baggage is highlighted.",
    "double": "Your emotions are intense, and you may feel drawn to help others or resolve old issues.",
    "multiple": "Too many 9s may bring emotional exhaustion. Focus on self-healing and avoid taking on others’ burdens."
  }
}


