{
  "1": {
    "single": "This phase ignites a powerful spark within you to take bold initiatives. Your confidence is rising and you feel ready to step out of your comfort zone. It’s an ideal time to start something new that truly reflects your individuality.",
    "double": "Your desire for independence is now twice as strong. You want to lead, make decisions your way, and claim your space. Just make sure that your enthusiasm doesn’t turn into impatience or impulsive decisions — balance your fire with thoughtfulness.",
    "multiple": "When 1’s energy dominates heavily, it can bring restlessness or ego conflicts with those around you. If others don’t share your vision, don’t push too hard. Instead, channel this fiery confidence into projects where you can shine without resistance."
  },
  "2": {
    "single": "You are feeling emotionally connected to people and situations. Conversations feel deeper, and you naturally crave harmony and emotional understanding. It’s a great time to build trust and nurture close bonds.",
    "double": "Your sensitivity is amplified, and you may feel like you need constant emotional reassurance. Small misunderstandings could hurt you more than usual, so open-hearted communication is key during this time.",
    "multiple": "An excess of 2 energy can bring confusion, overthinking, or emotional mood swings. Avoid absorbing too many emotions of others and instead focus on your own mental balance and self-care."
  },
  "3": {
    "single": "Your creative side is blooming, and you feel more expressive than usual. Whether through words, art, or ideas, you want to share what’s in your heart and mind. This is a great time for writing, speaking, or creative work.",
    "double": "Your charm and creativity feel doubled — you naturally attract attention and admiration. However, too many ideas can scatter your focus, so try to channel your energy into one strong plan.",
    "multiple": "Too many 3s can create restlessness, distractions, or shallow communication. This is a reminder to slow down and give depth to your creative expression, rather than rushing through everything."
  },
  "4": {
    "single": "You’re feeling the need to ground yourself and bring order to your life. Hard work and discipline feel natural now, and you are ready to build a strong foundation for the future.",
    "double": "Your inner perfectionist is active, pushing you to do everything with precision. While this can bring great results, avoid becoming too rigid or critical of others.",
    "multiple": "When 4 energy multiplies, it can create stress and over-controlling behavior. Try to let go of what you can’t control and focus on creating structure without losing flexibility."
  },
  "5": {
    "single": "Your mind is craving change and variety. You feel adventurous and curious, ready to explore something new — whether it’s travel, learning, or exciting opportunities.",
    "double": "Your desire for freedom and thrill is heightened. You may feel restless with routines, but avoid making sudden or risky decisions in the heat of the moment.",
    "multiple": "Too much 5 energy can bring chaos, lack of focus, or impulsive behavior. Use this energy wisely by channeling it into constructive adventures or new learning."
  },
  "6": {
    "single": "You are focused on love, family, and relationships. Creating harmony in your personal life feels natural, and you are more caring and protective of those you love.",
    "double": "Your nurturing energy is doubled, and you may want to shower affection on others. Be careful not to expect too much in return or feel disappointed.",
    "multiple": "Excess 6 energy can make you emotionally heavy or overly attached to others’ problems. Remember to care for yourself just as much as you care for them."
  },
  "7": {
    "single": "You feel reflective and thoughtful, often wanting to spend time in your own company. It’s a time of gaining wisdom, spiritual awareness, or deep introspection.",
    "double": "Your quest for answers is strong, and you might find yourself diving into spiritual studies, research, or personal development. Solitude feels refreshing now.",
    "multiple": "Too many 7s can make you overly detached or lost in your thoughts. Balance is key — don’t isolate yourself too much from the real world."
  },
  "8": {
    "single": "You’re focused on achieving success, financial stability, and building something long-term. Your determination and ambition are strong, helping you make big strides in your career or business.",
    "double": "Responsibilities feel heavier now, but you are capable of handling them with discipline. Your hard work can bring significant rewards if you stay patient and grounded.",
    "multiple": "Excess 8 energy may lead to stress, power struggles, or ego conflicts. Keep your calm and avoid taking on unnecessary pressure."
  },
  "9": {
    "single": "You feel more compassionate, thoughtful, and ready to let go of past baggage. It’s a time of healing, forgiveness, and helping others in need.",
    "double": "Your emotions are intense, and you may feel drawn toward resolving old conflicts or giving back to others. This can be a deeply fulfilling phase.",
    "multiple": "Too much 9 energy can make you feel drained or overwhelmed with emotions. Focus on self-healing before trying to fix others’ problems."
  }
}



