{
  "1": {
    "single": "<ul><li><strong>No. 1 Sun</strong> is boosting your confidence and desire to lead. You feel ready to step into the spotlight and claim what’s yours.</li> People around you notice your energy — use this to push forward with bold ideas or career moves. Don’t let pride or ego spoil this moment; pair your confidence with humility for lasting success.</ul>",
    "double": "<ul><li><strong>Two times No. 1 means Strong Sun's</strong> energy is burning brighter, making you fiercely independent and ambitious.</li> You want to do things your way, but remember that collaboration often brings bigger wins. Focus on leadership with kindness; a small act of gratitude can open new doors for you.</ul>",
    "multiple": "<ul><li>Too much <strong>Sun</strong> energy can make you restless or overly competitive.</li> Watch out for arguments or ego battles — especially with people close to you. Channel this fiery energy into projects that truly excite you, rather than proving a point.</ul>"
  },
  "2": {
    "single": "<ul><li><strong>No.2 Moon</strong> is stirring your heart, making you deeply sensitive and empathetic.</li> Your relationships take center stage — even a small emotional gesture can feel profound now. Express your feelings and listen to your loved ones; emotional honesty will bring you closer.</ul>",
    "double": "<ul><li><strong>No.2 Moon</strong> is doubling your emotional tides — you might crave love, care, or reassurance.</li> This is a powerful time for heart-to-heart conversations, but don’t overthink or assume. Focus on trust and vulnerability; opening up will strengthen your emotional bonds.</ul>",
    "multiple": "<ul><li>Too much <strong>No.2 Moon</strong> energy may leave you overwhelmed or emotionally drained.</li> Don’t carry the weight of everyone’s feelings — practice healthy emotional boundaries. Spend time in nature or journal your thoughts to bring emotional clarity.</ul>"
  },
  "3": {
    "single": "<ul><li><strong>No.3 Jupiter</strong> is lighting up your creativity and communication skills.</li><li>You might feel inspired to express yourself — through writing, art, or meaningful conversations.</li><li>Use this spark to share your ideas; your charm can attract opportunities and admiration.</li></ul>",
    "double": "<ul><li><strong>No.3 Jupiter</strong> doubles your expressive energy — ideas flow like a river, but they might feel scattered.</li> Take a moment to focus on one dream or goal at a time for better results. Networking or public speaking could bring unexpected recognition now.</ul>",
    "multiple": "<ul><li>Too much <strong>No.3 Jupiter</strong> energy might make you restless or overconfident.</li> Ground yourself by organizing your thoughts and avoiding impulsive promises. Use this creative surge to start something meaningful and long-lasting.</ul>"
  },
  "4": {
    "single": "<ul><li><strong>No.4 Rahu</strong> is asking you to create structure and discipline in your life.</li> You may feel the urge to organize your work, finances, or personal life for long-term stability. Focus on building a strong foundation rather than chasing quick results.</ul>",
    "double": "<ul><li><strong>No.4 Rahu</strong> doubles your need for control and perfection.</li> While your focus can bring achievements, don’t be too harsh on yourself or others. Balance discipline with flexibility to avoid burnout.</ul>",
    "multiple": "<ul><li>Excess <strong>No.4 Rahu</strong> energy can bring stress or a feeling of being stuck.</li> Let go of things you can’t control and focus on what truly matters. Take small breaks to clear your mind and return stronger.</ul>"
  },
  "5": {
    "single": "<ul><li><strong>No.5 Mercury</strong> is bringing curiosity and a thirst for new experiences.</li> You may feel adventurous, wanting to explore, learn, or meet new people. Follow your curiosity but think twice before making sudden decisions.</ul>",
    "double": "<ul><li><strong>No.5 Mercury</strong> doubles your restless energy — routines may feel suffocating.</li> You might feel pulled toward exciting changes or experiments. Stay grounded and ensure your choices align with long-term goals.</ul>",
    "multiple": "<ul><li>Too much <strong>No.5 Mercury</strong> energy can create chaos or confusion.</li> Slow down and take one step at a time. Use this adventurous spirit to learn something valuable or expand your horizons.</ul>"
  },
  "6": {
    "single": "<ul><li><strong>No.6 Venus</strong> shifts your focus toward love, family, and personal happiness.</li> You might feel drawn to creating a warm and beautiful environment around you. This is a perfect time to heal relationships and bring harmony to your personal life.</ul>",
    "double": "<ul><li><strong>No.6 Venus</strong> doubles your caring energy — you want to shower love on those who matter.</li> Be mindful of expectations; give love without waiting for immediate returns. Spend quality time with family or do something creative together.</ul>",
    "multiple": "<ul><li>Excess <strong>No.6 Venus</strong> energy can make you overly emotional or attached.</li> Don’t lose yourself while trying to please everyone. Balance self-love with care for others.</ul>"
  },
  "7": {
    "single": "<ul><li><strong>No.7 Ketu</strong> is guiding you inward, making you thoughtful and introspective.</li> You may seek quiet moments to reflect on life’s deeper meaning. This is a great time for meditation, journaling, or spiritual exploration.</ul>",
    "double": "<ul><li><strong>No.7 Ketu</strong> doubles your quest for truth and clarity.</li> Spending time alone can bring breakthroughs, but avoid disconnecting from reality. Use your intuition to make wise decisions now.</ul>",
    "multiple": "<ul><li>Excess <strong>No.7 Ketu</strong> energy can make you detached or overly withdrawn.</li> Don’t ignore people who care for you — balance solitude with connection. Channel your inner thoughts into something creative or healing.</ul>"
  },
  "8": {
    "single": "<ul><li><strong>No.8 Saturn</strong> is testing your discipline and patience, but rewards are on the way.</li> Your career and financial stability require hard work and focus now. Stay consistent and avoid shortcuts — long-term success is being built step by step.</ul>",
    "double": "<ul><li><strong>No.8 Saturn</strong> doubles the responsibilities on your shoulders.</li> Challenges may slow you down, but each step is building a strong future. Trust the process, plan carefully, and keep moving forward.</ul>",
    "multiple": "<ul><li>Excess <strong>No.8 Saturn</strong> energy can bring stress or power struggles.</li> Take breaks, meditate, or talk to a mentor to release pressure. Stay calm and focus on steady progress rather than quick wins.</ul>"
  },
  "9": {
    "single": "<ul><li><strong>No.9 Mars</strong> is filling you with passion, courage, and determination.</li> You are ready to let go of past baggage and fight for what truly matters. Use this energy to pursue goals fearlessly but avoid unnecessary conflicts.</ul>",
    "double": "<ul><li><strong>No.9 Mars</strong> doubles your intensity and emotional drive.</li> This can be a powerful time for career breakthroughs or personal transformation. Keep your temper in check and use this fire to build, not burn bridges.</ul>",
    "multiple": "<ul><li>Too much <strong>No.9 Mars</strong> energy can make you impulsive or aggressive.</li> Pause before reacting — your strength lies in controlled action.Channel your passion into fitness, career projects, or creative ventures.</ul>"
  }
}
